src/Catalogs/ММ_БазаДанных/ММ_БазаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ММ_БазаДанных</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ММ_Кластер1С</owners>
  <attributes>
    <name>ПутьДоФайлаCf</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДоХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинХранилище</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбновления</name>
    <type>
      <types>EnumRef.ММ_СпособыОбновления</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазы</name>
    <type>
      <types>EnumRef.ММ_ТипБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДоФайловойбазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ММ_СпособыОбновления/ММ_СпособыОбновления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ММ_СпособыОбновления</name>
  <enumValues>
    <name>ТиповыеОбновления</name>
  </enumValues>
  <enumValues>
    <name>ИзФайлаCf</name>
  </enumValues>
  <enumValues>
    <name>НеОбновлять</name>
  </enumValues>
  <enumValues>
    <name>ИзХранилищаКонфигурации</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ММ_ТипБазы/ММ_ТипБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ММ_ТипБазы</name>
  <enumValues>
    <name>Файловая</name>
  </enumValues>
  <enumValues>
    <name>Серверная</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ММ_БазаДанных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТипБазыПриИзмененииНаСервере();
	СпособОбновленияПриИзмененииНаСервере();
	АктуализацияПаролей();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПарольИзмененХранилище Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, ПарольХранилище, "ПарольХранилище");
		УстановитьПривилегированныйРежим(Ложь);
		ПарольХранилище = ?(ЗначениеЗаполнено(ПарольХранилище), УникальныйИдентификатор, "");
		ПарольИзмененХранилище = Ложь;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипБазыПриИзменении(Элемент)
	ТипБазыПриИзмененииНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура СпособОбновленияПриИзменении(Элемент)
	СпособОбновленияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПарольХранилищеПриИзменении(Элемент)

	ПарольИзмененХранилище = Истина;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АктуализацияПаролей()

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьПривилегированныйРежим(Истина);
		ПарольХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка, "ПарольХранилище");
		УстановитьПривилегированныйРежим(Ложь);
		ПарольХранилище = ?(ЗначениеЗаполнено(ПарольХранилище), УникальныйИдентификатор, "");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СпособОбновленияПриИзмененииНаСервере()

	ЭтоОбновлениеИзCf = Объект.СпособОбновления = Перечисления.ММ_СпособыОбновления.ИзФайлаCf;
	ЭтоОбновлениеИзХранилища = Объект.СпособОбновления = Перечисления.ММ_СпособыОбновления.ИзХранилищаКонфигурации;
	ЭтоТиповыеОбновления = Объект.СпособОбновления = Перечисления.ММ_СпособыОбновления.ТиповыеОбновления;
    // ToDo ЭтоТиповыеОбновления.
    
	Элементы.ОбновляемсяИзХранилища.Видимость = ЭтоОбновлениеИзХранилища;
	Элементы.ОбновляемсяИзCf.Видимость = ЭтоОбновлениеИзCf;
    
КонецПроцедуры

&НаСервере
Процедура ТипБазыПриИзмененииНаСервере()

	ЭтоФайловаяБаза = Объект.ТипБазы = Перечисления.ММ_ТипБазы.Файловая;
	ЭтоСервернаяБаза = Объект.ТипБазы = Перечисления.ММ_ТипБазы.Серверная;

	Элементы.НастройкиФайловойБазы.Видимость = ЭтоФайловаяБаза;
	Элементы.НастройкиСервернойБазы.Видимость = ЭтоСервернаяБаза;

	Если ЭтоФайловаяБаза Тогда
		Объект.Владелец = Справочники.ММ_Кластер1С.ФайловаяБаза;
	КонецЕсли;
	Если ЭтоСервернаяБаза Тогда
		Если Объект.Владелец = Справочники.ММ_Кластер1С.ФайловаяБаза Тогда
			Объект.Владелец = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
